[
  {
    "title": "Family History",
    "date": "April 2022",
    "slug": "fam_history",
    "img": "../res/fam_history.jpg",
    "alt": "Screenshot of family history website",
    "writeup": [
      "<p> Click <a href='../projects/family_history'>here</a> to check it out!</p>",
      "<p>Or click <a href='https://github.com/matkatd/family_history'>here</a> to view it on GitHub!</p>",
      "<h2>Context</h2>",
      "<p>I love my family, and I owe a lot to them. This project was an opportunity to make something that would be valuable to them. It's a database of stories and facts about my ancestors. It's using a LAMP stack that is hosted on my <a href='./project.html?proj=cloudclock&cat=other'>CloudClock server</a></p>"
    ]
  },
  {
    "title": "Precipice Ponderings",
    "date": "December 2021",
    "slug": "precipice",
    "img": "../res/precipice_ponder.jpg",
    "alt": "Screenshot of gear review website",
    "writeup": [
      "<p> Click <a href='https://matkatd.github.io/ReviewSite/'>here</a> to check it out!</p>",
      "<p>Or click <a href='https://github.com/matkatd/ReviewSite'>here</a> to view it on GitHub!</p>",
      "<h2>Context</h2>",
      "<p>This started as a project for an introductory web development class. The requirements were to build a multi page site related to something I was interested in. I took it further and turned it into a responsive site with dynamically generated pages.</p>",
      "<p>Initially I stored the data in JSON files. This worked fine, but I eventually moved it to Google Firebase to learn more about working with databases</p>"
    ]
  },
  {
    "title": "Ballard Brief",
    "date": "May 2022",
    "slug": "ballard_brief",
    "img": "../res/ballard_brief_hero.jpg",
    "alt": "Screenshot of Ballard Brief Website",
    "writeup": [
      "<p>Check out the current version <a href='https://ballardbrief.byu.edu'>here</a>!</p>",
      "<h2>Context</h2>",
      "<p>The <a href='https://ballard.byu.edu'>Ballard Center</a> is Brigham Young University's social impact center. It is the largest university social impact center in the world, and provides numerous programs such as classes, clubs, and internships that are focused on helping students make a difference in the world.</p>",
      "<p>The Ballard Brief is one of those programs. It's a social issue research library that takes student written briefs that are meticulously edited and publishes them. I had the opportunity to work as the \"website specialist\". My primary responsibilities are formatting the briefs in HTML so they can be published on the website, which is built in Squarespace, and making improvements to the site.</p>",
      "<p>When I started in December 2021, there were many complaints about the UX and UI of the website. My coworkers were the most vocal advocates of a website overhaul, as they were the ones who spent the most time on the website. Below is a picture of the old homepage. Unfortunately, I did not take very many screenshots of the original design, so any screenshots shown are from the wayback internet archive. This was my first experience doing UX design, so most of the process is me just figuring things out.</p>",
      "<img src='../res/ballard_brief_old.jpg' alt='Screenshot of the old Ballard Brief website design' />",
      "<h2>Process</h2>",
      "<p>My first step was to figure out why people didn't like the current design. While I already had some thoughts and ideas for improvement, I wanted to make sure I was going to fix things that mattered to the end user, rather than myself. In addition, I wanted to make sure I understood people's perception of the Ballard Brief brand. To help me understand these things, I distributed a survey asking the following questions: </p>",
      "<ol><li>How would you describe the mission of the Ballard Brief program?</li><li>What are the values of the Ballard Brief?</li><li>What kind of problems is the Ballard Brief trying to solve?</li><li>Why would someone want to come to our website?</li><li>Why would someone want to come back?</li><li>What kind of audience should the Ballard Brief cater towards?</li><li>What should people be led to do after coming to the website and reading a brief?</li><li>Share your favorite website(s) (i.e. the one with the best design/ user experience)</li>",
      "<p>Using this information, I proceeded to create a brand guide describing the purpose, vision, and attributes of the Ballard Brief. For this I relied heavily on the other members of the Ballard Brief team for input and copy.</p>",
      "<iframe src='https://storage.googleapis.com/cloudclock-pdf/Ballard_Brief_Style_Guide.pdf' width='100%' height='650px'>",
      "<p>My next step was to perform a competitive analysis. The two organizations I analyzed were the Stanford Social Innovation Review and the Harvard Social Innovation and Change Initiative. These are both high profile social impact organizations with readership that the Ballard Brief aspires to have.</p>",
      "<p>The results and summary of all the research performed by me and my team members can be seen in the following report:</p>",
      "<iframe src='../res/Website_Research_Analysis.pdf' width='100%' height='650px'>",
      "<p>The next step was to begin designing the new interface. I went straight into building each page in Adobe XD, rather than starting with paper prototypes. The major changes I implemented were brightening the color scheme, reorganizing the content to create a more logical flow, updating the images to align more with our brand, and adding additional content pages that are more relevant to the students interesting in writing briefs.</p>"
    ]
  },
  {
    "title": "Social Impact Projects",
    "date": "May 2022",
    "slug": "sip",
    "img": "../res/sip.jpg",
    "alt": "Screenshot of Social Impact Projects website",
    "writeup": [
      "<p>Check it out <a href='https://sip.byu.edu'>here</a>!</p>",
      "<h2>Context</h2>",
      "<p>Social Impact Projects case study</p>"
    ]
  }
]
